# Import dependencies

In [1]:
import os
import pandas as pd
import numpy as np

# Study data files: Toronto files:

In [2]:
toronto_Q1_path = os.path.join("Resources","2019-Q1.csv")
toronto_Q2_path = os.path.join("Resources", "2019-Q2.csv")
toronto_Q3_path = os.path.join("Resources", "2019-Q3.csv")
toronto_Q4_path = os.path.join("Resources", "2019-Q4.csv")

# Read the data and study the results:

In [3]:
q1 = pd.read_csv(toronto_Q1_path, encoding="utf=8")
# q2 = pd.read_csv(toronto_Q2_path, encoding="utf=8")
# q3 = pd.read_csv(toronto_Q3_path, encoding="utf=8")
# q4 = pd.read_csv(toronto_Q4_path, encoding="utf=8")

Renaming the columns:

In [4]:
q1 = q1.rename(columns={"Trip  Duration": "Trip Duration"})
# q2 = q2.rename(columns={"Trip  Duration": "Trip Duration"})
# q3 = q3.rename(columns={"Trip  Duration": "Trip Duration"})
# q4 = q4.rename(columns={"Trip  Duration": "Trip Duration"})

Creating DataFrame:

In [5]:
# Toronto = [q1, q2, q3, q4]
# bike_share = pd.concat(Toronto)
bike_share = q1

Deleting column "Trip Duration,Subscription Id,Start Station Name, End Station Name"

In [6]:
del bike_share['Trip Id']
del bike_share['Subscription Id']
del bike_share['Start Station Name']
del bike_share['End Station Name']
bike_share.head()

,Trip Duration,Start Station Id,Start Time,End Station Id,End Time,Bike Id,User Type
0,1547,7021,01/01/2019 00:08,7233,01/01/2019 00:33,1296,Annual Member
1,1112,7160,01/01/2019 00:10,7051,01/01/2019 00:29,2947,Annual Member
2,589,7055,01/01/2019 00:15,7013,01/01/2019 00:25,2293,Annual Member
3,259,7012,01/01/2019 00:16,7235,01/01/2019 00:20,283,Annual Member
4,281,7041,01/01/2019 00:19,7257,01/01/2019 00:24,1799,Annual Member

Renaming columns in the created dataframe

In [7]:
bike_share = bike_share.rename(columns={"Trip Duration": "trip_duration",
                                        "Start Station Id":"start_station_id",
                                        "End Station Id":"end_station_id",
                                        "Start Time":"start_date",
                                        "End Time":"end_date",
                                        "Bike Id":"bike_id",
                                        "User Type":"member_type"
                                       })
bike_share.head()

,trip_duration,start_station_id,start_date,end_station_id,end_date,bike_id,member_type
0,1547,7021,01/01/2019 00:08,7233,01/01/2019 00:33,1296,Annual Member
1,1112,7160,01/01/2019 00:10,7051,01/01/2019 00:29,2947,Annual Member
2,589,7055,01/01/2019 00:15,7013,01/01/2019 00:25,2293,Annual Member
3,259,7012,01/01/2019 00:16,7235,01/01/2019 00:20,283,Annual Member
4,281,7041,01/01/2019 00:19,7257,01/01/2019 00:24,1799,Annual Member

Identifying incomplete rows and Drop all rows with missing information

In [8]:
bike_share.count()

trip_duration       189063
start_station_id    189063
start_date          189063
end_station_id      189063
end_date            189063
bike_id             189063
member_type         189063
dtype: int64

In [9]:
bike_share = bike_share.dropna()

In [10]:
bike_share.count()

trip_duration       189063
start_station_id    189063
start_date          189063
end_station_id      189063
end_date            189063
bike_id             189063
member_type         189063
dtype: int64

Adding new column:location_id

In [11]:
bike_share = bike_share.assign(location_id=1)
bike_share.head()

,trip_duration,start_station_id,start_date,end_station_id,end_date,bike_id,member_type,location_id
0,1547,7021,01/01/2019 00:08,7233,01/01/2019 00:33,1296,Annual Member,1
1,1112,7160,01/01/2019 00:10,7051,01/01/2019 00:29,2947,Annual Member,1
2,589,7055,01/01/2019 00:15,7013,01/01/2019 00:25,2293,Annual Member,1
3,259,7012,01/01/2019 00:16,7235,01/01/2019 00:20,283,Annual Member,1
4,281,7041,01/01/2019 00:19,7257,01/01/2019 00:24,1799,Annual Member,1

Rearrange columns

In [12]:
bike_share = bike_share[["trip_duration","start_date","end_date",
                         "start_station_id","end_station_id","bike_id",
                         "member_type","location_id"]]
bike_share.head()

,trip_duration,start_date,end_date,start_station_id,end_station_id,bike_id,member_type,location_id
0,1547,01/01/2019 00:08,01/01/2019 00:33,7021,7233,1296,Annual Member,1
1,1112,01/01/2019 00:10,01/01/2019 00:29,7160,7051,2947,Annual Member,1
2,589,01/01/2019 00:15,01/01/2019 00:25,7055,7013,2293,Annual Member,1
3,259,01/01/2019 00:16,01/01/2019 00:20,7012,7235,283,Annual Member,1
4,281,01/01/2019 00:19,01/01/2019 00:24,7041,7257,1799,Annual Member,1

Creating Bikes dataframe with the following columns: BikeID & location_id

In [13]:
bikes = pd.DataFrame(bike_share[["bike_id","location_id"]])
bikes = bikes.drop_duplicates().reset_index(drop=True)
bikes.head()

   bike_id  location_id
0     1296            1
1     2947            1
2     2293            1
3      283            1
4     1799            1

Creating MemberType dataframe with the following columns: member_type & location_id

In [14]:
MemberType = pd.DataFrame(bike_share[["member_type","location_id"]])
MemberType = MemberType.drop_duplicates().reset_index(drop=True)
MemberType

     member_type  location_id
0  Annual Member            1
1  Casual Member            1

In [15]:
# cap to 5,000 records
bike_share = bike_share.head(5000)

In [16]:
# Save Combined DataFrames to CSV
bike_share.to_csv("toronto_bikeshare.csv", index=False, header=True)

In [17]:
bikes.to_csv("toronto_bikes.csv", index=False, header=True)

In [18]:
MemberType.to_csv("toronto_membertypes.csv", index=False, header=True)